# InitialWattageIntensity Class

---
This class encapsulates initial wattage intensity calculation.
SystemObject Autodesk.Revit.DB.LightingInitialIntensity Autodesk.Revit.DB.LightingInitialWattageIntensity
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class InitialWattageIntensity : InitialIntensity

    Public Class InitialWattageIntensity
    	Inherits InitialIntensity

    public ref class InitialWattageIntensity : public InitialIntensity

    type InitialWattageIntensity =
        class
            inherit InitialIntensity
        end
The InitialWattageIntensity type exposes the following members.
| Name| Description
---|---|---
| InitialWattageIntensity(InitialWattageIntensity)|  Creates a copy of the given initial wattage intensity object
| InitialWattageIntensity(Double, Double)|  Creates an initial wattage intensity object with the given values.
Top
| Name| Description
---|---|---
| Efficacy|  The efficacy value.
| InitialIntensityValue|  The calculated initial intensity value. (Inherited from InitialIntensity)
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from InitialIntensity)
| Wattage|  The wattage value.
Top
| Name| Description
---|---|---
| Clone|  Creates a copy of the InitialIntensity derived object. (Inherited from InitialIntensity)
| Dispose| (Inherited from InitialIntensity)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB.Lighting Namespace